// Auto-generated code. Do not edit.
namespace myImages {

    helpers._registerFactory("image", function(name: string) {
        switch(helpers.stringTrim(name)) {
            case "image1":
            case "Dør 1":return img`
e . . . . . . . . . . . . . . . 
e . . . . . . . . . . . . . . . 
e . . . . . . . . . . . . . . . 
e . . . . . . . . . . . . . . . 
e . . . . . . . . . . . . . . . 
e . . . . . . . . . . . . . . . 
e . . . . . . . . . . . . . . . 
e . . . . . . . . . . . . . . . 
e . . . . . . . . . . . . . . . 
e 5 . . . . . . . . . . . . . . 
e . . . . . . . . . . . . . . . 
e . . . . . . . . . . . . . . . 
e . . . . . . . . . . . . . . . 
e . . . . . . . . . . . . . . . 
e . . . . . . . . . . . . . . . 
e . . . . . . . . . . . . . . . 
`;
            case "image2":
            case "dør2":return img`
e . . . . . . . . . . . . . . . 
e . . . . . . . . . . . . . . . 
e . . . . . . . . . . . . . . . 
e . . . . . . . . . . . . . . . 
e . . . . . . . . . . . . . . . 
e . . . . . . . . . . . . . . . 
e . . . . . . . . . . . . . . . 
e . . . . . . . . . . . . . . . 
e . . . . . . . . . . . . . . . 
e 5 . . . . . . . . . . . . . . 
e . . . . . . . . . . . . . . . 
e . . . . . . . . . . . . . . . 
e . . . . . . . . . . . . . . . 
e . . . . . . . . . . . . . . . 
e . . . . . . . . . . . . . . . 
e . . . . . . . . . . . . . . . 
`;
            case "image3":
            case "dør3":return img`
. . . . . . . . . . . . . . . e 
. . . . . . . . . . . . . . . e 
. . . . . . . . . . . . . . . e 
. . . . . . . . . . . . . . . e 
. . . . . . . . . . . . . . . e 
. . . . . . . . . . . . . . . e 
. . . . . . . . . . . . . . . e 
. . . . . . . . . . . . . . . e 
. . . . . . . . . . . . . . . e 
. . . . . . . . . . . . . . 5 e 
. . . . . . . . . . . . . . . e 
. . . . . . . . . . . . . . . e 
. . . . . . . . . . . . . . . e 
. . . . . . . . . . . . . . . e 
. . . . . . . . . . . . . . . e 
. . . . . . . . . . . . . . . e 
`;
            case "image4":
            case "dør4":return img`
. . . . . . . . . . . . . . . e 
. . . . . . . . . . . . . . . e 
. . . . . . . . . . . . . . . e 
. . . . . . . . . . . . . . . e 
. . . . . . . . . . . . . . . e 
. . . . . . . . . . . . . . . e 
. . . . . . . . . . . . . . . e 
. . . . . . . . . . . . . . . e 
. . . . . . . . . . . . . . . e 
. . . . . . . . . . . . . . 5 e 
. . . . . . . . . . . . . . . e 
. . . . . . . . . . . . . . . e 
. . . . . . . . . . . . . . . e 
. . . . . . . . . . . . . . . e 
. . . . . . . . . . . . . . . e 
. . . . . . . . . . . . . . . e 
`;
            case "image5":
            case "dokument":return img`
. . . . . . . . . . . . . . . . 
. . . e e e e e e e e e e e e . 
. . e e e e e e e e e e e e . . 
. . e f f f f f f e f f f e . . 
. . e e e e e e e e e e e e . . 
. . e f e f f f f f e f f e . . 
. . e e e e e e e e e e e e . . 
. . e f f f f f f f f f f e . . 
. . e e e e e e e e e e e e . . 
. . e f f f f e f f f f f e . . 
. . e e e e e e e e e e e e . . 
. . e f f e f f f f f f f e . . 
. . e e e e e e e e e e e e . . 
. . e e e e e e e e e e e e . . 
. e e e e e e e e e e e e . . . 
. . . . . . . . . . . . . . . . 
`;
            case "image6":
            case "myImage":return img`
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
`;
            case "image7":
            case "Fange":return img`
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . 9 9 9 . . . . . . . 
. . . . . . 1 9 1 . . . . . . . 
. . . . . . 9 3 9 . . . . . . . 
. . . . . 4 4 4 4 4 . . . . . . 
. . . . . 9 4 4 4 9 . . . . . . 
. . . . . . 4 4 4 . . . . . . . 
. . . . . . 4 4 4 . . . . . . . 
. . . . . . 4 . 4 . . . . . . . 
. . . . . . 4 . 4 . . . . . . . 
`;
        }
        return null;
    })

    helpers._registerFactory("animation", function(name: string) {
        switch(helpers.stringTrim(name)) {

        }
        return null;
    })

    helpers._registerFactory("song", function(name: string) {
        switch(helpers.stringTrim(name)) {

        }
        return null;
    })

}
// Auto-generated code. Do not edit.
